---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.GetCustomHandles
source: html/56ea392d-ea71-d344-22bd-ab8a36c80797.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.GetCustomHandles Method

Gets the handle definitions for the rebar that were added.

## Syntax (C#)
```csharp
public IList<int> GetCustomHandles()
```

## Returns
Returns all custom handles.